In [9]:
import pandas as pd

In [10]:
dict1 = {
   "name": ["Atharv", "Akash"],
   "marks": [90,80],
   "city": ["Pune", "Kolkata"]
    
}

In [11]:
df = pd.DataFrame(dict1)

In [12]:
df

     name  marks     city
0  Atharv     90     Pune
1   Akash     80  Kolkata

In [13]:
df.to_csv("student.csv")

In [14]:
df.to_csv("student_false_index.csv", index = False)   # csv with no index

In [15]:
df.head(1)

     name  marks  city
0  Atharv     90  Pune

In [16]:
df.tail(1)

    name  marks     city
1  Akash     80  Kolkata

In [17]:
df.describe()

           marks
count   2.000000
mean   85.000000
std     7.071068
min    80.000000
25%    82.500000
50%    85.000000
75%    87.500000
max    90.000000

In [21]:
students = pd.read_csv("student.csv")        # to read any csv file

In [22]:
students

   Unnamed: 0    name  marks     city
0           0  Atharv     90     Pune
1           1   Akash     80  Kolkata

In [26]:
students["name"]

0    Atharv
1     Akash
Name: name, dtype: object

In [27]:
students["city"]

0       Pune
1    Kolkata
Name: city, dtype: object

In [28]:
students["city"][0]

'Pune'

In [30]:
students.index = ["One", "Two"]

In [31]:
students

     Unnamed: 0    name  marks     city
One           0  Atharv     90     Pune
Two           1   Akash     80  Kolkata